/*
#############################################################################################
# Rocket League (220128.59469.363257) SDK
# Generated with the UE3SDKGenerator v2.0.8
# ========================================================================================= #
# File: ProjectX_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/ItsBranK/UE3SDKGenerator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Function Parameters
# ========================================================================================= #
*/

// Function ProjectX._SharedHelpers.ScoreDeltaFromDefault
// [0x00022401] 
struct U_SharedHelpers_execScoreDeltaFromDefault_Params
{
	class UObject*                                     Object;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX._SharedHelpers.DrawShadowedText
// [0x00826003] 
struct U_SharedHelpers_execDrawShadowedText_Params
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FString                                     Text;                                             		// 0x0008 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	int32_t                                            ShadowOffsetX;                                    		// 0x0018 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            ShadowOffsetY;                                    		// 0x001C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            ShadowAlpha;                                      		// 0x0020 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	// float                                              X;                                                		// 0x0024 (0x0004) [0x0000000000000000]               
	// float                                              Y;                                                		// 0x0028 (0x0004) [0x0000000000000000]               
	// struct FColor                                      C;                                                		// 0x002C (0x0004) [0x0000000000000000]               
};

// Function ProjectX._SharedHelpers.IsInTransientPackage
// [0x00022401] 
struct U_SharedHelpers_execIsInTransientPackage_Params
{
	class UObject*                                     Obj;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX._SharedHelpers.GetAPlayerController
// [0x00026401] 
struct U_SharedHelpers_execGetAPlayerController_Params
{
	class UClass*                                      PlayerControllerClass;                            		// 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class APlayerController*                           ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function ProjectX._SharedHelpers.GetDefaultObject
// [0x00022401] 
struct U_SharedHelpers_execGetDefaultObject_Params
{
	class UClass*                                      ObjClass;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function ProjectX._SharedHelpers.DumpUnreferencedAnims
// [0x00022401] 
struct U_SharedHelpers_execDumpUnreferencedAnims_Params
{
};

// Function ProjectX._SharedHelpers.GetLanguageExtension
// [0x00022401] 
struct U_SharedHelpers_execGetLanguageExtension_Params
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.JoinCredentialsFromString
// [0x00422003] 
struct U_Types_X_execJoinCredentialsFromString_Params
{
	struct FString                                     Credentials;                                      		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     JoinName;                                         		// 0x0010 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FString                                     JoinPassword;                                     		// 0x0020 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	// TArray<struct FString>                             Result;                                           		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.JoinCredentialsToString
// [0x00022003] 
struct U_Types_X_execJoinCredentialsToString_Params
{
	struct FString                                     JoinName;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     JoinPassword;                                     		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.GenerateRandomPrivateMatchPassword
// [0x00022003] 
struct U_Types_X_execGenerateRandomPrivateMatchPassword_Params
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.GenerateRandomPrivateMatchName
// [0x00022003] 
struct U_Types_X_execGenerateRandomPrivateMatchName_Params
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.GenerateRandomName
// [0x00022003] 
struct U_Types_X_execGenerateRandomName_Params
{
	int32_t                                            Length;                                           		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FString                                     ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// struct FString                                     Chars;                                            		// 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	// int32_t                                            CharsLength;                                      		// 0x0028 (0x0004) [0x0000000000000000]               
	// struct FString                                     Result;                                           		// 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.OnTimer
// [0x00140001] 
struct U_Types_X_execOnTimer_Params
{
};

// Function ProjectX._Types_X.GetServerReservationData
// [0x00C22003] 
struct U_Types_X_execGetServerReservationData_Params
{
	struct FCheckReservationResponse                   Response;                                         		// 0x0000 (0x0080) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FServerReservationData                      ReturnValue;                                      		// 0x0080 (0x0080) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// struct FServerReservationData                      Data;                                             		// 0x0100 (0x0080) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function ProjectX._Types_X.ServiceExecutionDelegate
// [0x00120001] 
struct U_Types_X_execServiceExecutionDelegate_Params
{
	class UPsyNetClientService_X*                      Service;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX._Types_X.OnPriviledgeChecked
// [0x00120001] 
struct U_Types_X_execOnPriviledgeChecked_Params
{
	class UPrivilegeCheck_X*                           PrivilegeCheck;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ActorComponent_X.Reattach
// [0x00020401] 
struct UActorComponent_X_execReattach_Params
{
};

// Function ProjectX.ActorComponent_X.Tick
// [0x00080800] 
struct UActorComponent_X_eventTick_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ActorComponent_X.Detached
// [0x00080800] 
struct UActorComponent_X_eventDetached_Params
{
};

// Function ProjectX.ActorComponent_X.Attached
// [0x00080800] 
struct UActorComponent_X_eventAttached_Params
{
};

// Function ProjectX.ActorComponent_X.BeginPlay
// [0x00080800] 
struct UActorComponent_X_eventBeginPlay_Params
{
};

// Function ProjectX.ExplosionComponent_X.ProcessHit
// [0x00824802] 
struct UExplosionComponent_X_eventProcessHit_Params
{
	class AActor*                                      Victim;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               ExtraHitInfo;                                     		// 0x0018 (0x0028) [0x0000000000000080] (CPF_Parm)    
	float                                              DamageScale;                                      		// 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	// struct FVector                                     MomentumDir;                                      		// 0x0044 (0x000C) [0x0000000000000000]               
};

// Function ProjectX.ExplosionComponent_X.Detached
// [0x400080802] 
struct UExplosionComponent_X_eventDetached_Params
{
};

// Function ProjectX.ExplosionHitHandler_X.Destroy
// [0x00020002] 
struct UExplosionHitHandler_X_execDestroy_Params
{
};

// Function ProjectX.ExplosionHitHandler_X.Init
// [0x00020002] 
struct UExplosionHitHandler_X_execInit_Params
{
	class UActorComponent_X*                           ExplosionGoal;                                    		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function ProjectX.ExplosionHitHandler_X.ProcessHit
// [0x00424800] 
struct UExplosionHitHandler_X_eventProcessHit_Params
{
	class AActor*                                      Victim;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FContactInformation                         ContactInfo;                                      		// 0x0014 (0x001C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	float                                              DamageScale;                                      		// 0x0030 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function ProjectX.MICParamDispenserComponent_X.__MICParamDispenserComponent_X__Attached_542E0D2C4E0E21DC8761FABED242168A
// [0x40040003] 
struct UMICParamDispenserComponent_X_exec__MICParamDispenserComponent_X__Attached_542E0D2C4E0E21DC8761FABED242168A_Params
{
	struct FFXAttachment                               A;                                                		// 0x0000 (0x0110) [0x0000000000480080] (CPF_Parm | CPF_Component | CPF_NeedCtorLink)
	bool                                               ReturnValue : 1;                                  		// 0x0110 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.MICParamDispenserComponent_X.Attached
// [0x400080802] 
struct UMICParamDispenserComponent_X_eventAttached_Params
{
	// class AFXActor_X*                                  FXActor;                                          		// 0x0000 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.MICParamDispenserComponent_X.SetActorParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetActorParameter_Params
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      Value;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.MICParamDispenserComponent_X.SetLinearColorParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetLinearColorParameter_Params
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                Value;                                            		// 0x0008 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.MICParamDispenserComponent_X.SetVectorParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetVectorParameter_Params
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Value;                                            		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.MICParamDispenserComponent_X.SetFloatParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetFloatParameter_Params
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.MICParamDispenserComponent_X.SetNameParameter
// [0x00020401] 
struct UMICParamDispenserComponent_X_execSetNameParameter_Params
{
	struct FName                                       Key;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       Value;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.GetColorParameter
// [0x00420401] 
struct UShakeComponent_X_execGetColorParameter_Params
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
	struct FColor                                      OutColor;                                         		// 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ShakeComponent_X.GetVectorParameter
// [0x00420401] 
struct UShakeComponent_X_execGetVectorParameter_Params
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
	struct FVector                                     OutVector;                                        		// 0x0008 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ShakeComponent_X.GetFloatParameter
// [0x00420401] 
struct UShakeComponent_X_execGetFloatParameter_Params
{
	struct FName                                       InName;                                           		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
	float                                              OutFloat;                                         		// 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ShakeComponent_X.SetColorParameter
// [0x00020401] 
struct UShakeComponent_X_execSetColorParameter_Params
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      Param;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.SetVectorRandParameter
// [0x00420401] 
struct UShakeComponent_X_execSetVectorRandParameter_Params
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Param;                                            		// 0x0008 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FVector                                     ParamLow;                                         		// 0x0014 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
};

// Function ProjectX.ShakeComponent_X.SetVectorParameter
// [0x00020401] 
struct UShakeComponent_X_execSetVectorParameter_Params
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Param;                                            		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.SetFloatRandParameter
// [0x00020401] 
struct UShakeComponent_X_execSetFloatRandParameter_Params
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Param;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ParamLow;                                         		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.SetFloatParameter
// [0x00020401] 
struct UShakeComponent_X_execSetFloatParameter_Params
{
	struct FName                                       ParameterName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Param;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ShakeComponent_X.IsPlaying
// [0x00020003] 
struct UShakeComponent_X_execIsPlaying_Params
{
	bool                                               ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ShakeComponent_X.StopShake
// [0x00024803] 
struct UShakeComponent_X_eventStopShake_Params
{
	float                                              InBlendOutTime;                                   		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function ProjectX.ShakeComponent_X.InitParams
// [0x00080401] 
struct UShakeComponent_X_execInitParams_Params
{
};

// Function ProjectX.ShakeComponent_X.PlayShake
// [0x00020803] 
struct UShakeComponent_X_eventPlayShake_Params
{
};

// Function ProjectX.ShakeComponent_X.Detached
// [0x400080802] 
struct UShakeComponent_X_eventDetached_Params
{
};

// Function ProjectX.ShakeComponent_X.Attached
// [0x400080802] 
struct UShakeComponent_X_eventAttached_Params
{
};

// Function ProjectX.AdHocBeacon_X.GetNodeCountMax
// [0x00020401] 
struct UAdHocBeacon_X_execGetNodeCountMax_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.AdHocBeacon_X.AdHocJoinMatch
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocJoinMatch_Params
{
};

// Function ProjectX.AdHocBeacon_X.AdHocCreateMatch
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocCreateMatch_Params
{
};

// Function ProjectX.AdHocBeacon_X.AdHocIsActive
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocIsActive_Params
{
	bool                                               ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.AdHocBeacon_X.AdHocDisconnectFromAccessPoint
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocDisconnectFromAccessPoint_Params
{
};

// Function ProjectX.AdHocBeacon_X.AdHocConnectToAccessPoint
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocConnectToAccessPoint_Params
{
	int32_t                                            ScanResultIndex;                                  		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.AdHocBeacon_X.AdHocScanForAccessPoints
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocScanForAccessPoints_Params
{
};

// Function ProjectX.AdHocBeacon_X.AdHocBecomeStation
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocBecomeStation_Params
{
};

// Function ProjectX.AdHocBeacon_X.AdHocRejectStation
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocRejectStation_Params
{
	int32_t                                            NetworkNodeIndex;                                 		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.AdHocBeacon_X.AdHocBecomeAccessPoint
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocBecomeAccessPoint_Params
{
};

// Function ProjectX.AdHocBeacon_X.AdHocSetAdvertiseData
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocSetAdvertiseData_Params
{
	struct FString                                     AdvertiseData;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.AdHocBeacon_X.AdHocDestroy
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocDestroy_Params
{
};

// Function ProjectX.AdHocBeacon_X.AdHocCreate
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocCreate_Params
{
};

// Function ProjectX.AdHocBeacon_X.AdHocCreateWithUsername
// [0x00020401] 
struct UAdHocBeacon_X_execAdHocCreateWithUsername_Params
{
	struct FString                                     Username;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.AdHocBeacon_X.Construct
// [0x400020802] 
struct UAdHocBeacon_X_eventConstruct_Params
{
};

// Function ProjectX.FXActor_X.DumpDebugInfo
// [0x00820803] 
struct AFXActor_X_eventDumpDebugInfo_Params
{
	// class UFXActorEvent_X*                             FXState;                                          		// 0x0000 (0x0008) [0x0010000000000000]               
	// int32_t                                            ForEachRefIndex_8BF12E3C447C0FAE70D224B76F848568; 		// 0x0008 (0x0004) [0x0000000000000000]               
	// struct FFXAttachment                               Attachment;                                       		// 0x0010 (0x0110) [0x0010000000400000] (CPF_NeedCtorLink)
	// int32_t                                            ForEachRefIndex_17099EA0444B51B80E4550B21C2AEFCA; 		// 0x0120 (0x0004) [0x0000000000000000]               
	// class UFXActorEvent_X*                             AttachAnyEvent;                                   		// 0x0128 (0x0008) [0x0010000000000000]               
	// int32_t                                            ForEachRefIndex_A8DDE9344A3ECC1902FC27B07AB90590; 		// 0x0130 (0x0004) [0x0000000000000000]               
	// class UFXActorEvent_X*                             DetachAnyEvent;                                   		// 0x0138 (0x0008) [0x0010000000000000]               
	// int32_t                                            ForEachRefIndex_81C426834A1FBEA8B3FFDD993AF13755; 		// 0x0140 (0x0004) [0x0000000000000000]               
	// class UFXActorEvent_X*                             AttachAllEvent;                                   		// 0x0148 (0x0008) [0x0010000000000000]               
	// int32_t                                            ForEachRefIndex_A781AA0245CA57D873FDD4BC06B222C8; 		// 0x0150 (0x0004) [0x0000000000000000]               
	// class UFXAttachmentTraitBase_X*                    Trait;                                            		// 0x0158 (0x0008) [0x0010000000000000]               
	// int32_t                                            ForEachRefIndex_256F205443449D62566373B1D051FE4C; 		// 0x0160 (0x0004) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.GetTrait
// [0x00020401] 
struct AFXActor_X_execGetTrait_Params
{
	class UClass*                                      TraitClass;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            AttachmentIdx;                                    		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UFXAttachmentTraitBase_X*                    ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function ProjectX.FXActor_X.OnAnimEnd
// [0x400020802] 
struct AFXActor_X_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.OnAnimPlay
// [0x400020802] 
struct AFXActor_X_eventOnAnimPlay_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.Destroyed
// [0x400020802] 
struct AFXActor_X_eventDestroyed_Params
{
};

// Function ProjectX.FXActor_X.SubscribeState
// [0x00024401] 
struct AFXActor_X_execSubscribeState_Params
{
	class UFXActorEvent_X*                             FXEvent;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             OnPushed;                                         		// 0x0008 (0x0018) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
	struct FScriptDelegate                             OnPopped;                                         		// 0x0020 (0x0018) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.FXActor_X.SetStateEnabled
// [0x00020103] 
struct AFXActor_X_execSetStateEnabled_Params
{
	class UFXActorEvent_X*                             State;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               bEnable : 1;                                      		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function ProjectX.FXActor_X.OnToggle
// [0x00020103] 
struct AFXActor_X_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.OnTriggerFXActor_X
// [0x00020103] 
struct AFXActor_X_execOnTriggerFXActor_X_Params
{
	class USeqAct_TriggerFXActor_X*                    SeqAct;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class AActor*                                      AttachTo;                                         		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.Inherit
// [0x00880102] 
struct AFXActor_X_execInherit_Params
{
	class AFXActor_X*                                  Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                            OtherIdx;                                         		// 0x0008 (0x0004) [0x0000000000000000]               
	// struct FFXAttachment                               NewAttachment;                                    		// 0x0010 (0x0110) [0x0000000000400000] (CPF_NeedCtorLink)
};

// Function ProjectX.FXActor_X.ResetParticles
// [0x00020103] 
struct AFXActor_X_execResetParticles_Params
{
	// class UParticleSystemComponent*                    PSC;                                              		// 0x0000 (0x0008) [0x0000000004000000] (CPF_EditInline)
};

// Function ProjectX.FXActor_X.StopAllEffects
// [0x00080102] 
struct AFXActor_X_execStopAllEffects_Params
{
};

// Function ProjectX.FXActor_X.DeactivateAndDestroy
// [0x00020903] 
struct AFXActor_X_eventDeactivateAndDestroy_Params
{
};

// Function ProjectX.FXActor_X.OnDetached
// [0x00080903] 
struct AFXActor_X_eventOnDetached_Params
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function ProjectX.FXActor_X.DeactivateFXComponent
// [0x00020903] 
struct AFXActor_X_eventDeactivateFXComponent_Params
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	// class UAnimNodeSequence*                           AnimNodeSeq;                                      		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.ActivateFXComponent
// [0x00080903] 
struct AFXActor_X_eventActivateFXComponent_Params
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function ProjectX.FXActor_X.OnAttached
// [0x00080903] 
struct AFXActor_X_eventOnAttached_Params
{
	class UActorComponent*                             AC;                                               		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	// class USkeletalMeshComponent*                      AttachmentMesh;                                   		// 0x0008 (0x0008) [0x0000000004000000] (CPF_EditInline)
	// class UPrimitiveComponent*                         PrimComp;                                         		// 0x0010 (0x0008) [0x0000000004000000] (CPF_EditInline)
	// int32_t                                            AttachmentIdx;                                    		// 0x0018 (0x0004) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.GetComponentsAttachmentIndex
// [0x00020103] 
struct AFXActor_X_execGetComponentsAttachmentIndex_Params
{
	class UActorComponent*                             ComponentToFind;                                  		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	int32_t                                            ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.UpdateFXStates
// [0x00080501] 
struct AFXActor_X_execUpdateFXStates_Params
{
};

// Function ProjectX.FXActor_X.IsLocallyControlled
// [0x00080501] 
struct AFXActor_X_execIsLocallyControlled_Params
{
	bool                                               ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.GetControllerOwner
// [0x00080501] 
struct AFXActor_X_execGetControllerOwner_Params
{
	class AController*                                 ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.ToggleState
// [0x00020501] 
struct AFXActor_X_execToggleState_Params
{
	class UFXActorEvent_X*                             NewState;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.RemoveStateForceUpdate
// [0x00020501] 
struct AFXActor_X_execRemoveStateForceUpdate_Params
{
	class UFXActorEvent_X*                             OldState;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.RemoveEvent
// [0x00020501] 
struct AFXActor_X_execRemoveEvent_Params
{
	class UFXActorEvent_X*                             OldEvent;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.RemoveState
// [0x00020501] 
struct AFXActor_X_execRemoveState_Params
{
	class UFXActorEvent_X*                             OldState;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.AddEvent
// [0x00020501] 
struct AFXActor_X_execAddEvent_Params
{
	class UFXActorEvent_X*                             NewEvent;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.AddState
// [0x00020501] 
struct AFXActor_X_execAddState_Params
{
	class UFXActorEvent_X*                             NewState;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.CanRemoveEvent
// [0x00420501] 
struct AFXActor_X_execCanRemoveEvent_Params
{
	struct FFXActorEventCheck                          InEvent;                                          		// 0x0000 (0x0010) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	bool                                               ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.IsStateActive
// [0x00020501] 
struct AFXActor_X_execIsStateActive_Params
{
	class UFXActorEvent_X*                             InState;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.FXActor_X.Deactivate
// [0x00020401] 
struct AFXActor_X_execDeactivate_Params
{
};

// Function ProjectX.FXActor_X.Activate
// [0x00020401] 
struct AFXActor_X_execActivate_Params
{
};

// Function ProjectX.FXActor_X.HandleParentStatePopped
// [0x00040103] 
struct AFXActor_X_execHandleParentStatePopped_Params
{
	class AFXActor_X*                                  P;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UFXActorEvent_X*                             Event;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.HandleParentStatePushed
// [0x00040103] 
struct AFXActor_X_execHandleParentStatePushed_Params
{
	class AFXActor_X*                                  P;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UFXActorEvent_X*                             Event;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.BindTo
// [0x00020103] 
struct AFXActor_X_execBindTo_Params
{
	class AFXActor_X*                                  ParentFXActor;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class UFXActorEvent_X*                             ParentState;                                      		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.FXActor_X.SetAttachmentActor
// [0x00020102] 
struct AFXActor_X_execSetAttachmentActor_Params
{
	class AActor*                                      AttachToActor;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.PostBeginPlay
// [0x400020102] 
struct AFXActor_X_execPostBeginPlay_Params
{
};

// Function ProjectX.FXActor_X.AllAttachments
// [0x00424505] 
struct AFXActor_X_execAllAttachments_Params
{
	class UClass*                                      ComponentClass;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UActorComponent*                             OutComponent;                                     		// 0x0008 (0x0008) [0x0000000004000180] (CPF_Parm | CPF_OutParm | CPF_EditInline)
	int32_t                                            OutAttachmentIdx;                                 		// 0x0010 (0x0004) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
};

// Function ProjectX.FXActor_X.GetComponentByName
// [0x00020501] 
struct AFXActor_X_execGetComponentByName_Params
{
	class UClass*                                      ComponentClass;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       ComponentName;                                    		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UActorComponent*                             ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000004000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm | CPF_EditInline)
};

// Function ProjectX.FXActor_X.EventFXStatePopped
// [0x00120001] 
struct AFXActor_X_execEventFXStatePopped_Params
{
	class AFXActor_X*                                  FXActor;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UFXActorEvent_X*                             Event;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.FXActor_X.EventFXStatePushed
// [0x00120001] 
struct AFXActor_X_execEventFXStatePushed_Params
{
	class AFXActor_X*                                  FXActor;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UFXActorEvent_X*                             Event;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ArchetypeSpawnPoint_X.OnSpawned
// [0x00080003] 
struct AArchetypeSpawnPoint_X_execOnSpawned_Params
{
	class AActor*                                      Spawned;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class USequenceEvent*                              Evt;                                              		// 0x0008 (0x0008) [0x0000000000000000]               
	// int32_t                                            I;                                                		// 0x0010 (0x0004) [0x0000000000000000]               
};

// Function ProjectX.ArchetypeSpawnPoint_X.DoSpawn
// [0x00020003] 
struct AArchetypeSpawnPoint_X_execDoSpawn_Params
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class AActor*                                      Spawned;                                          		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.ArchetypeSpawnPoint_X.OnToggle
// [0x00020003] 
struct AArchetypeSpawnPoint_X_execOnToggle_Params
{
	class USeqAct_Toggle*                              Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ArchetypeSpawnPoint_X.OnDestroy
// [0x400020102] 
struct AArchetypeSpawnPoint_X_execOnDestroy_Params
{
	class USeqAct_Destroy*                             Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class AActor*                                      A;                                                		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.ArchetypeSpawnPoint_X.PostBeginPlay
// [0x400020802] 
struct AArchetypeSpawnPoint_X_eventPostBeginPlay_Params
{
};

// Function ProjectX.ArchetypeSpawnPoint_X.EventSpawned
// [0x00120001] 
struct AArchetypeSpawnPoint_X_execEventSpawned_Params
{
	class AArchetypeSpawnPoint_X*                      SpawnPoint;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      Spawned;                                          		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.Aws4Signature_X.SignRequest
// [0x00022401] 
struct UAws4Signature_X_execSignRequest_Params
{
	class UHttpRequestInterface*                       HTTPRequest;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_C3AD9E3340CCAB3350800F8B73B34671
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_C3AD9E3340CCAB3350800F8B73B34671_Params
{
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_2020784A428D50111F58298DE7B6F651
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_2020784A428D50111F58298DE7B6F651_Params
{
	class UPsyNetBeaconConnection_X*                   Connection;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_A25D926F49F804E2C3D0778CDDB00966
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_A25D926F49F804E2C3D0778CDDB00966_Params
{
	class UPsyNetBeacon_X*                             _;                                                		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UPsyNetBeaconConnection_X*                   Connection;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_5899160042CEA39DA11FB88F5BA63AD8
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_5899160042CEA39DA11FB88F5BA63AD8_Params
{
	class UPsyNetBeacon_X*                             _;                                                		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UPsyNetBeaconConnection_X*                   Connection;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_ABCDA6D246A8F85F3125C293D6266926
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_ABCDA6D246A8F85F3125C293D6266926_Params
{
	class UTcpConnection*                              Connection;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_FB1E76134F5F2C0302639D87CE9DCE8E
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_FB1E76134F5F2C0302639D87CE9DCE8E_Params
{
	class UTcpBeacon*                                  _;                                                		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UTcpConnection*                              Connection;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.__ReservationBeacon_X__Construct_6F2F8DD6490ED55BD0F44EA5A27489B4
// [0x40040003] 
struct UReservationBeacon_X_exec__ReservationBeacon_X__Construct_6F2F8DD6490ED55BD0F44EA5A27489B4_Params
{
	class UTcpBeacon*                                  _;                                                		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UTcpConnection*                              Connection;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.ServerReserveConnection
// [0x00024003] 
struct UReservationBeacon_X_execServerReserveConnection_Params
{
	struct FString                                     ReservationID;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FUniqueNetId                                PlayerID;                                         		// 0x0010 (0x0048) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              ConnectionTimeoutSeconds;                         		// 0x0058 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UIReservationConnection_X*                   ReturnValue;                                      		// 0x0060 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ReservationBeacon_X.BeginPsyNetConnect
// [0x00020003] 
struct UReservationBeacon_X_execBeginPsyNetConnect_Params
{
	struct FString                                     ReservationID;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     DSRToken;                                         		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UIReservationConnection_X*                   ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ReservationBeacon_X.BeginTcpConnect
// [0x00020003] 
struct UReservationBeacon_X_execBeginTcpConnect_Params
{
	struct FString                                     BeaconURL;                                        		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UIReservationConnection_X*                   ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ReservationBeacon_X.BeginConnect
// [0x00020003] 
struct UReservationBeacon_X_execBeginConnect_Params
{
	struct FServerReservationData                      Reservation;                                      		// 0x0000 (0x0080) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UIReservationConnection_X*                   ReturnValue;                                      		// 0x0080 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.ReservationBeacon_X.Close
// [0x00020003] 
struct UReservationBeacon_X_execClose_Params
{
};

// Function ProjectX.ReservationBeacon_X.CloseConnection
// [0x00020003] 
struct UReservationBeacon_X_execCloseConnection_Params
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	// class UTcpConnection*                              TcpConnection;                                    		// 0x0010 (0x0008) [0x0000000000000000]               
	// class UPsyNetBeaconConnection_X*                   PsyNetConnection;                                 		// 0x0018 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.ReservationBeacon_X.BroadcastMessage
// [0x00020803] 
struct UReservationBeacon_X_eventBroadcastMessage_Params
{
	class UObject*                                     Message;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.SendReservationMessage
// [0x00420003] 
struct UReservationBeacon_X_execSendReservationMessage_Params
{
	struct FServerReservationData                      Reservation;                                      		// 0x0000 (0x0080) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class UObject*                                     Message;                                          		// 0x0080 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.SendMessage
// [0x00020803] 
struct UReservationBeacon_X_eventSendMessage_Params
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	// class UTcpConnection*                              TcpConnection;                                    		// 0x0018 (0x0008) [0x0000000000000000]               
	// class UPsyNetBeaconConnection_X*                   PsyNetConnection;                                 		// 0x0020 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.ReservationBeacon_X.CreateMessage
// [0x00020401] 
struct UReservationBeacon_X_execCreateMessage_Params
{
	class UClass*                                      MessageClass;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UBeaconMessage_X*                            ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000D80] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_CoerceParm)
};

// Function ProjectX.ReservationBeacon_X.ReceiveMessage
// [0x00020401] 
struct UReservationBeacon_X_execReceiveMessage_Params
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.RemoveMessageHandler
// [0x00020401] 
struct UReservationBeacon_X_execRemoveMessageHandler_Params
{
	struct FScriptDelegate                             Callback;                                         		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.ReservationBeacon_X.AddMessageHandler
// [0x00020401] 
struct UReservationBeacon_X_execAddMessageHandler_Params
{
	class UClass*                                      MessageClass;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FScriptDelegate                             Callback;                                         		// 0x0008 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.ReservationBeacon_X.BeginListen
// [0x00020003] 
struct UReservationBeacon_X_execBeginListen_Params
{
};

// Function ProjectX.ReservationBeacon_X.Construct
// [0x400020802] 
struct UReservationBeacon_X_eventConstruct_Params
{
};

// Function ProjectX.ReservationBeacon_X.EventDisconnected
// [0x00120001] 
struct UReservationBeacon_X_execEventDisconnected_Params
{
	class UReservationBeacon_X*                        Beacon;                                           		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UIReservationConnection_X*                   Connection;                                       		// 0x0008 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.EventConnected
// [0x00120001] 
struct UReservationBeacon_X_execEventConnected_Params
{
	class UReservationBeacon_X*                        Beacon;                                           		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UIReservationConnection_X*                   Connection;                                       		// 0x0008 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.ReservationBeacon_X.MessageReceivedDelegate
// [0x00140001] 
struct UReservationBeacon_X_execMessageReceivedDelegate_Params
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Message;                                          		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function ProjectX.BeaconMessage_X.Broadcast
// [0x00020401] 
struct UBeaconMessage_X_execBroadcast_Params
{
	class UBeaconMessage_X*                            ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.BeaconMessage_X.Send
// [0x00020401] 
struct UBeaconMessage_X_execSend_Params
{
	class UIReservationConnection_X*                   Connection;                                       		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	class UBeaconMessage_X*                            ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function ProjectX.BugReport_X.HandleHttpRequestComplete
// [0x00040401] 
struct UBugReport_X_execHandleHttpRequestComplete_Params
{
	class UHttpRequestInterface*                       OriginalRequest;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UHttpResponseInterface*                      InHttpResponse;                                   		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               bDidSucceed : 1;                                  		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function ProjectX.BugReport_X.LogText
// [0x00040401] 
struct UBugReport_X_execLogText_Params
{
	struct FString                                     Str;                                              		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function ProjectX.BugReport_X.PDIReport
// [0x00080803] 
struct UBugReport_X_eventPDIReport_Params
{
	// class AActor*                                      A;                                                		// 0x0000 (0x0008) [0x0000000000000000]               
	// class UDebugDrawer*                                Drawer;                                           		// 0x0008 (0x0008) [0x0000000000000000]               
};

// Function ProjectX.BugReport_X.CancelBugReport
// [0x00020401] 
struct UBugReport_X_execCancelBugReport_Params
{
};

// Function ProjectX.BugReport_X.SubmitBugReport
// [0x00024401] 
struct UBugReport_X_execSubmitBugReport_Params
{
	struct FString                                     Title;                                            		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     Description;                                      		// 0x0010 (0x0010) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
	struct FString                                     Email;                                            		// 0x0020 (0x0010) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
};

// Function ProjectX.BugReport_X.StartBugReport
// [0x00020401] 
struct UBugReport_X_execStartBugReport_Params
{
};

// Function ProjectX.BugReport_X.StaticSubmitBugReport
